Lambosaurus/STM32X/Lib/SPI.h
#ifndef SPI_H
#define SPI_H

#include "STM32X.h"
#ifdef SPI_DMA_ENABLE
#include "DMA.h"
#endif

/*
 * FUNCTIONAL TESTING
 * STM32L0: Y
 * STM32F0: Y
 * STM32G0: Y
 * STM32WL: N
 */

/*
 * PUBLIC DEFINITIONS
 */

/*
 * PUBLIC TYPES
 */

typedef void (*SPI_Callback_t)(const uint8_t * rxdata, uint32_t size);

typedef struct {
	SPI_TypeDef * Instance;
	uint32_t bitrate;
#ifdef SPI_DMA_ENABLE
	DMA_t * rx_dma;
	DMA_t * tx_dma;
#endif
} SPI_t;

typedef enum {
	SPI_Mode_0 = SPI_POLARITY_LOW | SPI_PHASE_1EDGE,
	SPI_Mode_1 = SPI_POLARITY_LOW | SPI_PHASE_2EDGE,
	SPI_Mode_2 = SPI_POLARITY_HIGH | SPI_PHASE_1EDGE,
	SPI_Mode_3 = SPI_POLARITY_HIGH | SPI_PHASE_2EDGE,
} SPI_Mode_t;


/*
 * PUBLIC FUNCTIONS
 */

// Initialisation
void SPI_Init(SPI_t * spi, uint32_t bitrate, SPI_Mode_t mode);
void SPI_Deinit(SPI_t * spi);

// Transaction functions
void SPI_Write(SPI_t * spi, const uint8_t * data, uint32_t count);
void SPI_Read(SPI_t * spi, uint8_t * data, uint32_t count);
void SPI_Transfer(SPI_t * spi, const uint8_t * txdata, uint8_t * rxdata, uint32_t count);
uint8_t SPI_TransferByte(SPI_t * spi, uint8_t data);

#ifdef SPI_DMA_ENABLE
void SPI_Start(SPI_t * spi, const uint8_t * txdata, uint8_t * rxdata, uint32_t count, bool circular, SPI_Callback_t callback);
void SPI_Stop(SPI_t * spi);
#endif

/*
 * EXTERN DECLARATIONS
 */

#ifdef SPI1_PINS
extern SPI_t * const SPI_1;
#endif
#ifdef SPI2_PINS
extern SPI_t * const SPI_2;
#endif
#ifdef SPI3_PINS
extern SPI_t * const SPI_3;
#endif


#endif //SPI_H
